; domain
(define (domain Kitchen)
  (:requirements  :strips  :typing  :negative-preconditions  :disjunctive-preconditions )
  (:types
   room  heater  window  alarm  exhaust_fan  message hvac_system - object
   )

  (:predicates
          (temp-under-control)
          (load-msg)
          (explosion-prevention)
          (hvac-control)
          (deactivate ?x - hvac_system)
          (in ?x - hvac_system ?r - room)
          (on ?h - heater)
          (off ?a - alarm)
          (close ?w - window)
          (off1 ?e - exhaust_fan)
          (inside ?h - heater ?r - room)
          (at-window ?w - window ?r - room)
          (at-exhaust ?e - exhaust_fan ?r - room)
          (at-alarm ?a - alarm ?r - room)
          (send ?m - message)

   )

   (:functions
	  (temp ?r - room)
	  (weight ?r - room)
	  (hum ?r - room)
	  (lpg ?r - room)
	  (flame ?r - room)
      (co2 ?r - room)
       (temp_threshold)
       (weight_threshold)
       (hum_threshold)
       (lpg_threshold)
       (flame_threshold)
       (co2_threshold)
   )

  ;;comment

  (:action switchoff_heater
        :parameters (?h - heater ?r - room ?m - message)
        :precondition (and (on ?h) (>(temp ?r) (temp_threshold))(>(hum ?r) (hum_threshold)))
        :effect (and(not(on ?h)) (send ?m) (temp-under-control))
   )
   (:action switchon_heater
        :parameters (?h - heater ?r - room ?m - message)
        :precondition (or (not(on ?h)) (<(temp ?r) (temp_threshold))(<(hum ?r) (hum_threshold)))
        :effect (and (on ?h) (send ?m) (temp-under-control))
   )
   (:action open_window-turnon_exhaust-trigger_alarm
       :parameters ( ?a - alarm ?e - exhaust_fan ?w - window ?r - room ?m - message)
       :precondition (and (off ?a) (off1 ?e) (close ?w) (>(lpg ?r) (lpg_threshold))(<(flame ?r) (flame_threshold)))
       :effect (and (not(off ?a)) (not(off1 ?e)) (not(close ?w)) (send ?m) (explosion-prevention))
  )
  (:action close_window-turnoff_exhaust-donttrigger_alarm
       :parameters ( ?a - alarm ?e - exhaust_fan ?w - window ?r - room ?m - message)
       :precondition (or (not(off ?a)) (not(off1 ?e)) (not(close ?w)) (<(lpg ?r) (lpg_threshold))(>=(flame ?r) (flame_threshold)))
       :effect (and (off ?a) (off1 ?e) (close ?w) (send ?m) (explosion-prevention))
  )
  (:action on_hvac
        :parameters (?x - hvac_system ?r - room ?m - message)
        :precondition (or (deactivate ?x) (>(co2 ?r) (co2_threshold)))
        :effect (and(not(deactivate ?x)) (send ?m) (hvac-control))
   )
   (:action off_evac
        :parameters (?x - hvac_system ?r - room ?m - message)
        :precondition (or (not(deactivate ?x))  (<(co2 ?r) (co2_threshold)))
        :effect (and (deactivate ?x) (send ?m) (hvac-control))
   )
   (:action notification_cylinderbooking
        :parameters ( ?r - room ?m - message )
        :precondition (and  (>(weight ?r) (weight_threshold)))
        :effect (and  (send ?m) (load-msg))
   )
   (:action no_notification_cylinderbooking
        :parameters ( ?r - room ?m - message )
        :precondition (and  (<(weight ?r) (weight_threshold)))
        :effect (and  (send ?m) (load-msg))
   )
      )

; problem
(define (problem Safety)
(:domain Kitchen)
(:objects
   r1 - room
   h1 - heater
   w1 - window
   e1 - exhaust_fan
   a1 - alarm
   x1 - hvac_system
   m1 - message)
(:init
    (on h1)
    (inside h1 r1)
    (close w1)
    (at-window w1 r1)
    (off1 e1)
    (at-exhaust e1 r1)
    (off a1)
    (at-alarm a1 r1)
    (deactivate x1)
    (in x1 r1)
    ;temp
    (= (temp_threshold) 26)
    (= (temp r1) 27.763907128602515)
    ;load
    (= (weight_threshold) 27)
    (= (weight r1) 26.101130228127804)
    ;hum
    (= (hum_threshold) 65)
    (= (hum r1) 67.0 )
    ;flame
    (= (flame_threshold) 1)
    (= (flame r1) 0)
    ;mq2 sensor
    (= (lpg_threshold) 700)
    (= (lpg r1) 1849.0356490313784)
    ;co2 sensor
    (= (co2_threshold) 500)
    (= (co2 r1) 1729.8957177484228)

)
(:goal
    (and
    (temp-under-control)
    (explosion-prevention)
    (load-msg)
    (hvac-control)))
)

; plan
1. (no_notification_cylinderbooking r1 m1)
   added: (send m1) (load-msg)
   goals met: 1 of 4
2. (on_hvac x1 r1 m1)
   deleted: (deactivate x1)
   added: (hvac-control)
   goals met: 2 of 4
3. (switchoff_heater h1 r1 m1)
   deleted: (on h1)
   added: (temp-under-control)
   goals met: 3 of 4
4. (open_window-turnon_exhaust-trigger_alarm a1 e1 w1 r1 m1)
   deleted: (off a1) (off1 e1) (close w1)
   added: (explosion-prevention)
   goals met: 4 of 4
